In [10]:
import pandas as pd
import numpy as np
stuff = {'A': [1, 2, 3,], 'B': [4, np.nan, 6], 'C': [7, 8, 9], 'D': [10, 11, 12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [4]:
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [5]:
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [9]:
my_df.dropna(thresh=2, axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [13]:
my_df.fillna(value=99)

   A     B  C   D
0  1   4.0  7  10
1  2  99.0  8  11
2  3   6.0  9  12

In [14]:
my_df.fillna(value=my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [17]:
my_df.fillna(value=my_df['B'].sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12